//#include "main.cpp"
//
//int main() {
//    machine1.C_reg = 1; //! TODO: Звідки вона в реальності починала?
//    //! TODO: Додати тести всіх команд!
//    //! TODO: Ще тут буде потім перевірка, чи зупиняти машину при виникненні ситуації переповнення -- керується кнопкою на пульт
//    machine1.kmem[1] = 0'01'0003'0004'0005ULL;
//    machine1.kmem[2] = 0'04'0003'0004'0005ULL;
//    machine1.kmem[3] = 0'02'0003'0004'0005ULL;
//    machine1.kmem[4] = 0'01'0003'0004'0005ULL;
//    std::cout << get_A1(machine1.kmem[1]);
//    while(machine1.execute_opcode()){
//
//
//        // Ще тут буде потім перевірка, чи зупиняти машину при виникненні ситуації переповнення -- керується кнопкою на пульті
//    }
//
//    return 0;
//
//    return 0;
//}
